{
  "projects": {
    "coroata-conecta": {
      "title": "Coroatá Conecta",
      "description": "Um conceito de design moderno, responsivo e intuitivo, desenvolvido para oferecer uma experiência acessível e fluida aos usuários. Criado especialmente para a cidade de Coroatá, o projeto tem como objetivo facilitar a compra, venda e aluguel de produtos e serviços, conectando moradores e comerciantes em uma plataforma dinâmica e eficiente.",
      "date": "09/01/2025",
      "src": "../CoroataMock.png",
      "links": {
        "figmaLink": "https://www.figma.com/design/x4eeQKKFtnFSQkVcX8U5Ns/Coroata-Conecta?node-id=1-85&t=jFTvvmlNFS6f3cL1-1"
      },
      "context": "Projeto de design focado na experiência do usuário e acessibilidade.",
      "challenges": [
        "Criar um layout visualmente atraente e funcional",
        "Garantir a responsividade para dispositivos móveis"
      ],
      "solution": {
        "features": ["Componentes de UI modernos", "Design responsivo"],
        "stack": ["Figma", "Design System personalizado"]
      },
      "result": "Uma identidade visual sofisticada e intuitiva, projetada para proporcionar uma experiência envolvente e harmoniosa, servindo como base sólida para futuras implementações e expansões."
    },
    "studyhub": {
      "title": "StudyHub",
      "description": "Um design de aplicativo inovador, desenvolvido para aprimorar a experiência de aprendizado, auxiliando os usuários na criação de rotinas eficientes e em uma abordagem mais produtiva para os estudos.",
      "date": "11/02/2025",
      "src": "../StudyHubMock.png",
      "links": {
        "figmaLink": "https://www.figma.com/design/pZ0eHOzoH72lP1BejwBKMl/StudyHub?node-id=3-2&t=wi4jiqurhGDJ2chH-1"
      },
      "context": "Projeto de design para um aplicativo educacional com foco em organização e usabilidade.",
      "challenges": [
        "Criar uma interface intuitiva para facilitar o estudo",
        "Equilibrar um design minimalista com funcionalidades completas"
      ],
      "solution": {
        "features": ["Interface limpa e organizada", "Navegação fluida e acessível"],
        "stack": ["Figma", "Design System moderno"]
      },
      "result": "Uma interface limpa e estratégica, focada em otimizar a produtividade dos usuários, oferecendo uma experiência de aprendizado fluida e eficiente, com grande potencial para expansões e integrações futuras."
    },
    "lumina": {
      "title": "Lumina",
      "description": "Uma plataforma inteligente de gestão financeira pessoal, desenvolvida para simplificar o controle de receitas, despesas e metas financeiras. Criada com foco em usabilidade e análise de dados, a Lumina auxilia usuários a tomar decisões financeiras mais informadas através de relatórios detalhados, categorização automática de transações e acompanhamento de objetivos financeiros em tempo real.",
      "date": "02/01/2026",
      "src": "../lumina.png",
      "links": {
        "demo": "https://lumina.arthurdevleal.tech",
        "repo": "https://github.com/ArthurDevLeal/study-planner-front-end"
      },
      "context": "Projeto full-stack focado em gestão financeira inteligente e experiência do usuário intuitiva.",
      "challenges": [
        "Criar uma interface intuitiva para gerenciamento financeiro complexo",
        "Implementar sistema de categorização automática de transações",
        "Garantir segurança e privacidade dos dados financeiros",
        "Desenvolver relatórios e gráficos em tempo real"
      ],
      "solution": {
        "features": [
          "Dashboard interativo com gráficos",
          "Categorização automática",
          "Relatórios financeiros detalhados",
          "Metas e progresso em tempo real",
          "Autenticação segura",
          "Histórico de transações completo"
        ],
        "stack": [
          "Next.js",
          "TypeScript",
          "React",
          "Tailwind CSS",
          "PostgreSQL",
          "Figma",
          "Express.js",
          "Node.js"
        ]
      },
      "result": "Uma plataforma robusta e elegante que oferece controle financeiro abrangente, combinando análise inteligente de dados com uma interface moderna e responsiva, facilitando a tomada de decisões financeiras conscientes e proporcionando uma experiência fluida em qualquer dispositivo."
    }
  }
}
